 /* SPDX-License-Identifier: Apache-2.0 */
 /* Copyright 2026 Ross S. - plic: a PL/I compiler targeting LLVM */
 /* Diagnostic test: SYSPARM takes no arguments. */
 bad_sysparm: procedure options(main);
    declare t char(8);

    t = sysparm('x');
 end bad_sysparm;
