 /* SPDX-License-Identifier: Apache-2.0 */
 /* Copyright 2026 Ross S. - plic: a PL/I compiler targeting LLVM */
 /* SUBSTR built-in function: substr(s, i, n) extracts n characters of the
    character string s starting at the 1-based position i. M2 string built-in
    (Y33-6003 SUBSTR). */
 substr_test: procedure options(main);
    declare s char(8);
    declare t char(3);
    declare fails fixed bin(31);

    fails = 0;

    s = 'ABCDEFGH';
    t = substr(s, 2, 3);
    if t ^= 'BCD' then do;
       fails = fails + 1;
       put skip list('FAIL substr(2,3) =', t);
    end;

    t = substr(s, 1, 1);
    if t ^= 'A' then do;
       fails = fails + 1;
       put skip list('FAIL substr(1,1) =', t);
    end;

    t = substr('abcdef', 4, 3);
    if t ^= 'def' then do;
       fails = fails + 1;
       put skip list('FAIL substr lit =', t);
    end;

    if fails = 0 then put skip list('PASS substr');
    else put skip list('FAIL substr: fails =', fails);
 end substr_test;
