 /* SPDX-License-Identifier: Apache-2.0 */
 /* Copyright 2026 Ross S. - plic: a PL/I compiler targeting LLVM */
  /* rule (114): only a scalar value is
     displayed. */
  baddisplay: procedure options(main);
     declare a(3) fixed bin(31);
     display(a);
  end baddisplay;
