 /* SPDX-License-Identifier: Apache-2.0 */
 /* Copyright 2026 Ross S. - plic: a PL/I compiler targeting LLVM */
 /* rule (82): WAIT requires EVENT vars. */
 bad_task: procedure options(main);
    declare e fixed binary(31);
    wait(e);
 end bad_task;
