 /* SPDX-License-Identifier: Apache-2.0 */
 /* Copyright 2026 Ross S. - plic: a PL/I compiler targeting LLVM */
 /* rule (99): CONVERSION is not a valid
    programmer-named condition. */
 badoncondconv: procedure options(main);
    signal condition(conversion);
 end badoncondconv;
