 /* OPTIONAL (extension): omitted() takes
    an OPTIONAL parameter. */
 badomitted: procedure options(main);
    declare x fixed bin(31);
    if omitted(x) then x = 1;
 end badomitted;
