 /* SPDX-License-Identifier: Apache-2.0 */
 /* Copyright 2026 Ross S. - plic: a PL/I compiler targeting LLVM */
 /* ADR-171: INITIAL/VALUE on an ENTRY variable is not implemented. */
 bad_entry_var_init: procedure options(main);
   dcl cb entry (fixed bin(31)) variable initial(0);
 end bad_entry_var_init;
