 /* SPDX-License-Identifier: Apache-2.0 */
 /* Copyright 2026 Ross S. - plic: a PL/I compiler targeting LLVM */
 /* ADR-171: VARIABLE is only valid on an ENTRY declaration. */
 bad_entry_var: procedure options(main);
   dcl x fixed bin(31) variable;
 end bad_entry_var;
