 /* SPDX-License-Identifier: Apache-2.0 */
 /* Copyright 2026 Ross S. - plic: a PL/I compiler targeting LLVM */
 /* C28-6571-3 Chapter 9, The INCLUDE Statement */
 main: procedure options(main);
 /* %include missing_in_comment.inc; */
 put skip list('%include missing_in_string.inc;');
 %include include_outer.inc;
 end main;
