/* parsum.pli - parallel sum using two async task events (rules (79),(82),(88),(90)). */
/* See plic README for the full example. */
parrallel_sum: proc options(main);
    dcl i fixed bin(31);
    dcl heap pointer,
        data(100) fixed bin(31) based(heap);
    dcl (ev1, ev2) event;
    dcl (part1, part2) fixed bin(31);

    allocate data set(heap);
    do i = 1 to 100;
        data(i) = i;
    end;

    part1 = 0; part2 = 0;
    call sum_first event(ev1);
    call sum_second event(ev2);
    wait(ev1, ev2);

    put skip list('sum 1..100 =', part1 + part2);
    free data;

sum_first: proc;
    dcl (j, s) fixed bin(31);
    s = 0;
    do j = 1 to 50;
        s = s + data(j);
    end;
    part1 = s;
end;

sum_second: proc;
    dcl (j, s) fixed bin(31);
    s = 0;
    do j = 51 to 100;
        s = s + data(j);
    end;
    part2 = s;
end;

end;
