 /* Preprocessor: shared header, shorthand, conditional code. 

    Run: plic preprocessor.pli -o pp */

 %include 'preprocessor_defs.inc';

 %replace bound by 5;
 %declare debug value(1);
 %activate debug;

 demo: proc options(main);
   dcl table(%tabcap) char(80) varying;
   dcl small(bound) fixed bin(31);

   dcl i fixed bin(31);
   do i = 1 to bound;
     small(i) = i;
   end;
   put skip list('cap =', %tabcap);
   put skip list('sum =', sum(small));
   table(1) = 'hello';
   put skip list('first =', table(1));

   %if debug = 1 %then put skip list('debug is on');
   %else put skip list('debug is off');
 end;
